
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Entering PyTorch · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Masashi Kimura">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="machine_learning.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Entering PyTorch
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="machine_learning.html">
            
                <a href="machine_learning.html">
            
                    
                    機械学習
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="about_deeplearning.html">
            
                <a href="about_deeplearning.html">
            
                    
                    ディープラーニング
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="settings.html">
            
                <a href="settings.html">
            
                    
                    環境設定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pytorch.html">
            
                <a href="pytorch.html">
            
                    
                    PyTorch
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Entering PyTorch</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="entering-pytorch">Entering PyTorch</h1>
<p>Convergence Lab. &#x6728;&#x6751;&#x512A;&#x5FD7; <a href="mailto:kimura@convergence-lab.com" target="_blank">kimura@convergence-lab.com</a></p>
<h2 id="&#x306F;&#x3058;&#x3081;&#x306B;">&#x306F;&#x3058;&#x3081;&#x306B;</h2>
<p>&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306F;&#x6025;&#x901F;&#x306A;&#x767A;&#x5C55;&#x3092;&#x3068;&#x3052;&#x3001;&#x4ECA;&#x307E;&#x3055;&#x306B;&#x4E16;&#x754C;&#x3092;&#x5857;&#x308A;&#x66FF;&#x3048;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x305D;&#x308C;&#x4EE5;&#x524D;&#x306B;&#x306F;&#x4E0D;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x3063;&#x305F;&#x69D8;&#x3005;&#x306A;&#x3053;&#x3068;&#x304C;&#x5B9F;&#x73FE;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3089;&#x3067;&#x3059;&#x3002;</p>
<ul>
<li>&#x4EBA;&#x9593;&#x3092;&#x8D85;&#x3048;&#x308B;&#x7CBE;&#x5EA6;&#x306E;&#x753B;&#x50CF;&#x8A8D;&#x8B58;&#x304C;&#x5B9F;&#x73FE;&#x3055;&#x308C;&#x3001;&#x8FD1;&#x3044;&#x5C06;&#x6765;&#x306B;&#x533B;&#x7642;&#x753B;&#x50CF;&#x8A3A;&#x65AD;&#x306E;&#x81EA;&#x52D5;&#x5316;&#x304C;&#x5B9F;&#x73FE;&#x3059;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</li>
<li>&#x97F3;&#x58F0;&#x8A8D;&#x8B58;&#x3084;&#x81EA;&#x7136;&#x8A00;&#x8A9E;&#x51E6;&#x7406;&#x306E;&#x767A;&#x5C55;&#x306F;&#x3001;&#x81EA;&#x7136;&#x306A;&#x5BFE;&#x8A71;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30FC;&#x30B9;&#x3092;&#x5B9F;&#x73FE;&#x3059;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</li>
<li>&#x5F37;&#x5316;&#x5B66;&#x7FD2;&#x306E;&#x9032;&#x5316;&#x306F;&#x3001;&#x81EA;&#x52D5;&#x904B;&#x8EE2;&#x6280;&#x8853;&#x306B;&#x3064;&#x306A;&#x304C;&#x3063;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;</li>
</ul>
<p>&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306E;&#x885D;&#x6483;&#x3068;&#x3044;&#x3046;&#x3068;&#x3001;AlexNet&#x304C;ImageNet&#x306E;&#x30B3;&#x30F3;&#x30DA;&#x30C6;&#x30A3;&#x30B7;&#x30E7;&#x30F3;&#x3067;SVM&#x30D9;&#x30FC;&#x30B9;&#x306E;&#x624B;&#x6CD5;&#x306B;10%&#x4EE5;&#x4E0A;&#x306E;&#x5DEE;&#x3092;&#x3064;&#x3051;&#x3066;&#x4E00;&#x4F4D;&#x306B;&#x306A;&#x3063;&#x305F;&#x4E8B;&#x4F8B;&#x304C;&#x6CE8;&#x76EE;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x79C1;&#x306B;&#x3068;&#x3063;&#x3066;&#x306E;&#x305D;&#x308C;&#x306F;&#x97F3;&#x58F0;&#x8A8D;&#x8B58;&#x5206;&#x91CE;&#x306E;&#x3053;&#x3068;&#x3067;&#x3057;&#x305F;&#x3002;&#x5927;&#x5B66;&#x306E;&#x7814;&#x7A76;&#x5BA4;&#x3067;&#x97F3;&#x58F0;&#x8A8D;&#x8B58;&#x3092;&#x7814;&#x7A76;&#x3057;&#x3066;&#x3044;&#x305F;&#x3001;2012&#x5E74;&#x9803;&#x306E;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;Geoffrey Hinton&#x3089;&#x306E;&#x65B0;&#x3057;&#x3044;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x30D9;&#x30FC;&#x30B9;&#x306E;&#x97F3;&#x58F0;&#x8A8D;&#x8B58;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x9AD8;&#x3044;&#x7CBE;&#x5EA6;&#x3092;&#x5B9F;&#x73FE;&#x3057;&#x305F;&#x3053;&#x3068;&#x3092;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x8AD6;&#x6587;&#x3067;&#x77E5;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p>
<p>Geoffrey Hinton Li Deng Dong Yu George Dahl Abdel-rahman Mohamed Navdeep Jaitly Andrew Senior Vincent Vanhoucke Patrick Nguyen Brian Kingsbury Tara Sainath, Deep Neural Networks for Acoustic Modeling in Speech Recognition, IEEE Signal Processing Magazine | November 2012, Vol 29: pp. 82-97
<a href="https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/38131.pdf" target="_blank">https://static.googleusercontent.com/media/research.google.com/en//pubs/archive/38131.pdf</a></p>
<p>&#x5F53;&#x6642;&#x3001;&#x540C;&#x3058;&#x3088;&#x3046;&#x306B;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x7528;&#x3044;&#x305F;&#x97F3;&#x58F0;&#x8A8D;&#x8B58;&#x3092;&#x7814;&#x7A76;&#x3057;&#x3066;&#x3044;&#x305F;&#x79C1;&#x306B;&#x3068;&#x3063;&#x3066;&#x3001;&#xFF16;&#x5C64;&#x306E;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x5229;&#x7528;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x8003;&#x3048;&#x3089;&#x308C;&#x306A;&#x3044;&#x65B9;&#x6CD5;&#x3067;&#x3057;&#x305F;&#x3002;&#x7121;&#x9650;&#x306E;&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#x3092;&#x6301;&#x3064;&#xFF13;&#x5C64;&#x306E;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x306F;&#x4E07;&#x80FD;&#x95A2;&#x6570;&#x8FD1;&#x4F3C;&#x6027;&#x3092;&#x3082;&#x3064;&#x3053;&#x3068;&#x304C;&#x77E5;&#x3089;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x5F53;&#x6642;&#x306F;&#x3001;&#xFF13;&#x5C64;&#x4EE5;&#x4E0A;&#x306E;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306F;&#x610F;&#x5473;&#x304C;&#x306A;&#x3044;&#x3068;&#x601D;&#x308F;&#x308C;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#xFF14;&#x5C64;&#x306E;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x4F7F;&#x3046;&#x3068;&#x3001;&#x305D;&#x308C;&#x3060;&#x3051;&#x3067;&#x7814;&#x7A76;&#x4F1A;&#x3067;&#x8CEA;&#x554F;&#x8CAC;&#x3081;&#x306B;&#x3042;&#x3046;&#x3088;&#x3046;&#x306A;&#x98A8;&#x6F6E;&#x3067;&#x3057;&#x305F;&#x3002;ReLU&#x95A2;&#x6570;&#x306E;&#x6709;&#x52B9;&#x6027;&#x304C;&#x767A;&#x898B;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5F53;&#x6642;&#x3067;&#x306F;&#x3001;&#xFF14;&#x5C64;&#x4EE5;&#x4E0A;&#x306E;&#x30CB;&#x30E5;&#x30FC;&#x30E9;&#x30EB;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x5B66;&#x7FD2;&#x306F;&#x73FE;&#x5B9F;&#x7684;&#x306B;&#x56F0;&#x96E3;&#x3067;&#x3057;&#x305F;&#x3002;&#x305D;&#x3093;&#x306A;&#x4E2D;&#x3001;Hinton&#x9054;&#x306F;&#x3001;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x3063;&#x3066;&#x5F53;&#x6642;&#x306E;&#x6700;&#x5148;&#x7AEF;&#x30B9;&#x30B3;&#x30A2;&#x3092;&#x76F8;&#x5BFE;&#x3067;30%&#x3082;&#x6539;&#x5584;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x3053;&#x306E;&#x6280;&#x8853;&#x306F;&#x5FC5;&#x305A;&#x8EAB;&#x306B;&#x3064;&#x3051;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3068;&#x3001;&#x5F53;&#x6642;&#x306E;&#x79C1;&#x306F;&#x601D;&#x3063;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;</p>
<p>&#x3044;&#x307E;&#x3067;&#x306F;&#x3001;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306F;&#x5927;&#x304D;&#x306A;&#x767A;&#x5C55;&#x3092;&#x3068;&#x3052;&#x3001;&#x8AB0;&#x3082;&#x304C;&#x7C21;&#x5358;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x672C;&#x3067;&#x306F;&#x3001;PyTorch&#x3092;&#x7528;&#x3044;&#x305F;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3092;&#x5B66;&#x3073;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306E;&#x6280;&#x8853;&#x3092;&#x662F;&#x975E;&#x3001;&#x8EAB;&#x306B;&#x3064;&#x3051;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
<h2 id="&#x672C;&#x66F8;&#x306B;&#x3064;&#x3044;&#x3066;">&#x672C;&#x66F8;&#x306B;&#x3064;&#x3044;&#x3066;</h2>
<p>&#x672C;&#x66F8;&#x3067;&#x306F;&#x3001;&#x3069;&#x306E;&#x3088;&#x3046;&#x306B;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x66F8;&#x304F;&#x306E;&#x304B;&#x3001;&#x306A;&#x305C;&#x305D;&#x306E;&#x3088;&#x3046;&#x306B;&#x66F8;&#x304F;&#x306E;&#x304B;&#x3092;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x76EE;&#x6307;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3053;&#x306E;&#x672C;&#x306F;&#x3001;&#x57FA;&#x672C;&#x7684;&#x306A;Python&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x7FD2;&#x5F97;&#x3057;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x524D;&#x63D0;&#x306B;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x3001;Python&#x306B;&#x4E0D;&#x6163;&#x308C;&#x306A;&#x306E;&#x3067;&#x3057;&#x305F;&#x3089;&#x3001;<a href="https://docs.python.org/ja/3/tutorial/" target="_blank">Python &#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;</a>&#x3092;&#x3001;&#x5B66;&#x7FD2;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x304A;&#x52E7;&#x3081;&#x3057;&#x307E;&#x3059;&#x3002;
&#x307E;&#x305F;&#x3001;&#x89E3;&#x8AAC;&#x4E2D;&#x306B;&#x3001;Numpy &#x3084; Pandas &#x3068;&#x3044;&#x3063;&#x305F;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3092;&#x7528;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x89E3;&#x8AAC;&#x306F;&#x672C;&#x66F8;&#x306E;&#x7BC4;&#x56F2;&#x5916;&#x3067;&#x3059;&#x3002;&#x5225;&#x306E;&#x8CC7;&#x6599;&#x3092;&#x53C2;&#x8003;&#x306B;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p>
<p>&#x6A5F;&#x68B0;&#x5B66;&#x7FD2;&#x3084;&#x30C7;&#x30A3;&#x30FC;&#x30D7;&#x30E9;&#x30FC;&#x30CB;&#x30F3;&#x30B0;&#x305D;&#x306E;&#x3082;&#x306E;&#x306E;&#x89E3;&#x8AAC;&#x3082;&#x542B;&#x307F;&#x307E;&#x3059;&#x304C;&#x3001;&#x9650;&#x5B9A;&#x7684;&#x306A;&#x5185;&#x5BB9;&#x306B;&#x6B62;&#x3081;&#x308B;&#x3064;&#x3082;&#x308A;&#x3067;&#x3059;&#x3002;&#x305D;&#x308C;&#x3089;&#x306F;&#x4ED6;&#x306E;&#x8CC7;&#x6599;&#x3092;&#x53C2;&#x8003;&#x306B;&#x3059;&#x308B;&#x3068;&#x826F;&#x3044;&#x672C;&#x304C;&#x305F;&#x304F;&#x3055;&#x3093;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3053;&#x306E;&#x672C;&#x3067;&#x5BFE;&#x8C61;&#x306B;&#x3059;&#x308B;PyTorch&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306F;1.3&#x3067;&#x3059;&#x3002;&#x305D;&#x308C;&#x4EE5;&#x5916;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x691C;&#x8A3C;&#x3092;&#x884C;&#x306A;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x89E3;&#x8AAC;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x52D5;&#x304B;&#x306A;&#x3044;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<p>&#x30C7;&#x30FC;&#x30BF;&#x30B5;&#x30A4;&#x30A8;&#x30F3;&#x30B9;&#x3067;&#x306F;&#x3001;Jupyter Notebook&#x304C;&#x3088;&#x304F;&#x5229;&#x7528;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x672C;&#x66F8;&#x3067;&#x306F;&#x3001;Jupyter Notebook&#x306E;&#x4F7F;&#x7528;&#x306F;&#x6700;&#x4F4E;&#x9650;&#x306B;&#x6B62;&#x3081;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;Jupyter&#x306F;&#x4FBF;&#x5229;&#x3067;&#x3059;&#x304C;&#x3001;AI&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x3092;&#x8003;&#x3048;&#x305F;&#x5834;&#x5408;&#x306B;&#x306F;&#x3001;&#x901A;&#x5E38;&#x306E; .py&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x65B9;&#x304C;&#x6271;&#x3044;&#x3084;&#x3059;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;</p>
<p>&#x307E;&#x305F;&#x3001;&#x672C;&#x66F8;&#x306F;&#x3001;&#x30AF;&#x30EA;&#x30A8;&#x30A4;&#x30C6;&#x30A3;&#x30D6;&#x30B3;&#x30E2;&#x30F3;&#x30BA; CC-BY-NC-SA &#x3067;&#x3059;&#x3002;</p>
<p><a href="https://creativecommons.org/licenses/by-nc-sa/2.1/jp/" target="_blank"><img src="imgs/Cc-by-nc-sa_icon.svg" alt="CC-BY-NC-SA"></a></p>
<p>&#x672C;&#x66F8;&#x306E;&#x89E3;&#x8AAC;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x305F;&#x30B3;&#x30FC;&#x30C9;&#x306F; MIT License&#x306B;&#x3057;&#x305F;&#x304C;&#x3046;&#x3082;&#x306E;&#x3068;&#x3057;&#x307E;&#x3059;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="machine_learning.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 機械学習">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Entering PyTorch","level":"1.1","depth":1,"next":{"title":"機械学習","level":"1.2","depth":1,"path":"machine_learning.md","ref":"machine_learning.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","prism","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Masashi Kimura","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"gitbook":"*"},"file":{"path":"README.md","mtime":"2019-10-26T06:57:32.226Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-10-26T08:03:46.895Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

